app/views/team_members/show.html.erb

            <td align = 'center'>
              <% if row.places.length > 0 %>
---
SELECT "places".* FROM "places" WHERE "places"."team_members_id" = $1  [["team_members_id", 4]]