app/controllers/managers_controller.rb

SELECT  "managers".* FROM "managers" WHERE "managers"."email" = $1 AND "managers"."password" = $2 LIMIT $3  [["email", "abcd@gmail.com"], ["password", "rtyu"], ["LIMIT", 1]]
---
  def validate
    manager = Manager.find_by(email: params[:uname], password: params[:psw])

SELECT  "managers".* FROM "managers" ORDER BY "managers"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def show
    manager = Manager.first

SELECT  "team_members".* FROM "team_members" WHERE "team_members"."email" = $1 AND "team_members"."name" = $2 LIMIT $3  [["email", "poiuy"], ["name", "poiuy"], ["LIMIT", 1]]
SELECT  "managers".* FROM "managers" ORDER BY "managers"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "managers" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Admin"], ["email", "abcd@gmail.com"], ["password", "test1234"], ["created_at", "2018-08-28 12:58:36.441649"], ["updated_at", "2018-08-28 12:58:36.441649"]]
INSERT INTO "team_members" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "tanusree"], ["email", "moditanusree@gmail.com"], ["password", "1234"], ["created_at", "2018-08-24 12:40:55.720841"], ["updated_at", "2018-08-24 12:40:55.720841"]]
---
  def insert
    team_member = TeamMember.find_by(email: params[:name])
    if !team_member.present?
      token = rand(100) * 900000 + Time.new.sec * 987654321 + rand(10000) * 5600000
      UserMailer.send_email(params, token).deliver_now
      m = Manager.first
      p m
      TeamMember.create!(name: params[:name], email: params[:email], password: params[:password], managers_id: m.id, token: token )