app/controllers/places_controller.rb

  def suggested_places_add
    id = session[:current_user]
    Place.create!(name: params[:pname], address: params[:addr], team_members_id: id.to_i )
    manager_id = session[:manager]
    manager = Manager.find_by_id(manager_id)
---
INSERT INTO "places" ("name", "address", "team_members_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdfgh"], ["address", "sdfgh"], ["team_members_id", 2], ["created_at", "2018-08-28 12:02:04.321799"], ["updated_at", "2018-08-28 12:02:04.321799"]]
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]