app/controllers/team_members_controller.rb

SELECT  "team_members".* FROM "team_members" WHERE "team_members"."email" = $1 AND "team_members"."password" = $2 LIMIT $3  [["email", ""], ["password", ""], ["LIMIT", 1]]
---
  def validate
    team_member = TeamMember.find_by(email: params[:email], password: params[:psw])

SELECT "team_members".* FROM "team_members" WHERE "team_members"."managers_id" = $1  [["managers_id", 1]]
---
  def show
    @team_members = TeamMember.where(managers_id: session[:manager])

SELECT  "team_members".* FROM "team_members" WHERE "team_members"."token" = $1 LIMIT $2  [["token", "38489117284"], ["LIMIT", 1]]
UPDATE "team_members" SET "password" = $1, "updated_at" = $2 WHERE "team_members"."id" = $3  [["password", "123456"], ["updated_at", "2018-08-24 14:00:20.340823"], ["id", 1]]
---
  def update
    team_member = TeamMember.find_by(token: params[:token])
    if(params[:psw].eql?(params[:con_psw]))
      team_member.update(password: params[:psw])

SELECT "places".* FROM "places" WHERE "places"."team_members_id" = $1  [["team_members_id", 4]]
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "places" SET "updated_at" = $1, "is_final" = $2 WHERE "places"."id" = $3  [["updated_at", "2018-08-30 01:44:48.387692"], ["is_final", "f"], ["id", 1]]
---
  def finalize
    id = params[:optradio].split("&id=")[1].split("&tid=")[0]
    tid = params[:optradio].split("&tid=")[1]
    places = Place.where(team_members_id: tid.to_i)
    places.each do |row|
      row.update(is_final: false)
    end
    place = Place.find_by_id(id)
    place.update(is_final: true) if place.present?